In [2]:
import pandas as pd

col_names = ['year','one','tens','someyear','2o','tt']
df = pd.read_csv("data.csv", header=None, names=col_names, na_values=-1, parse_dates=[[0,1,2]])
df.to_excel('dataaa.xlsx', index=False)
dfe = pd.read_excel('dataaa.xlsx')
dfe

  year_one_tens  someyear    2o  tt
0    1818-01-11  1818.004   NaN   1
1    1818-01-12  1818.034   NaN   1
2    1818-01-13  1818.037  22.0   1
3    1818-01-14  1818.012  32.0   1
4    1818-01-15  1818.032   NaN   1
5    1818-01-16  1818.026   NaN   1
6    1818-01-17  1818.056  54.0   1
7    1818-01-18  1818.076   NaN   1
8    1818-01-19  1818.088  34.0   1

In [3]:
tx = pd.read_fwf('data.txt',index_col=False, header=None)
tx.head()

            0         1     2  3
0  1818-01-11  1818.004   NaN  1
1  1818-01-12  1818.034   NaN  1
2  1818-01-13  1818.037  22.0  1
3  1818-01-14  1818.012  32.0  1
4  1818-01-15  1818.032   NaN  1

In [32]:
ebola = pd.read_csv("C:\\Users\\ac29019\\py-data\\ebola_data_db_format.csv", parse_dates = ['Date'])
ebola.head()

,Indicator,Country,Date,value
0,"Cumulative number of confirmed, probable and s...",Guinea,2015-03-10,3285.0
1,Cumulative number of confirmed Ebola cases,Guinea,2015-03-10,2871.0
2,Cumulative number of probable Ebola cases,Guinea,2015-03-10,392.0
3,Cumulative number of suspected Ebola cases,Guinea,2015-03-10,22.0
4,"Cumulative number of confirmed, probable and s...",Guinea,2015-03-10,2170.0